/*
 * Blue Gene/P interrupt controller
 *
 * Linux wants IRQs mapped to a small integer space.
 *
 * The bic defines 15 groups and 32 group interrupts in each group.
 * We encode an IRQ number like this (which requires NR_IRQS=512):
 *    GGGGIIIII
 *   where GGGG is the 4-bit group number+1 (i.e. GGGG=0000 is not used),
 *   and IIIII is the 5-bit interrupt index within the 32-bit word.
 * The interrupt indexes are numbered from the left bit (powerpc-style).
 * We avoid encoding GGGG=0000 so we never end up with an IRO=0 which is a
 * flag for "no interrupt" in arch/powerpc.
 *
 * The IPIs subdivide the group 0 interrupt word as follows:
 *
 *  CRSD CRSD CRSD CRSD .... .... .... ....
 *  0    4    8    12   16   20   24   28
 *  cpu0 cpu1 cpu2 cpu3

 * where C=call, R=resched, S=call-single, D=debug, and .=unused
 *
 * We encode IPI IRQ numbers specially.   By the above encoding they would be
 * 32..47 for these 16 bits.
 *
 * The other 16 bits in group 0 are treated normally.   These will translate to
 * IRQ = 48..63 and can be used by software to simulate hardware interrupts for
 * other purposes.
 *
 *
 * Todd Inglett <tinglett@us.ibm.com>
 * Copyright 2003-2009 International Business Machines, Inc.
 *
 * This program is free software; you can redistribute  it and/or modify it
 * under  the terms of  the GNU General  Public License as published by the
 * Free Software Foundation;  either version 2 of the  License, or (at your
 * option) any later version.
 */

#include <linux/init.h>
#include <linux/irq.h>
#include <linux/io.h>
#include <linux/spinlock.h>
#include <asm/bluegene.h>

/* #define TJCW_USE_BYTEWISE */
/* #define BIC_DIAGNOSE 1 */

#if defined(BIC_DIAGNOSE)
extern int bgp_dma_tcp_tracemask ;
static int bic_diagnose_count  ;
enum {
	k_bic_diagnose_limit = 100
};
static unsigned int bic_diagnosing(void)
{
	if( 0 == (bgp_dma_tcp_tracemask & 0x80000000) )
		{
		if( bic_diagnose_count < k_bic_diagnose_limit)
			{
				bic_diagnose_count += 1 ;
				return 1 ;
			}
		}
	else
		{
			bic_diagnose_count = 0 ;
		}
	return 0 ;
}
#define BIC_DIAG(X) if(bic_diagnosing()) { X ; }
#else
#define BIC_DIAG(X)
#endif

void bic_unmask_irq(unsigned int irq);
EXPORT_SYMBOL(bic_unmask_irq) ;
static void bic_mask_irq(unsigned int irq);
static void bic_eoi_irq(unsigned int irq);

static void bic_unmask_irq_bytewise(unsigned int irq) __attribute__((unused)) ;

static void bic_mask_irq_bytewise(unsigned int irq) __attribute__((unused)) ;
#if defined(TJCW_USE_BYTEWISE)
static struct irq_chip bgp_irq_chip = {
	.name		= "BIC",
	.unmask		= bic_unmask_irq_bytewise,
	.mask		= bic_mask_irq_bytewise,
	.eoi		= bic_eoi_irq,
};
#else
static struct irq_chip bgp_irq_chip = {
	.name		= "BIC",
	.unmask		= bic_unmask_irq,
	.mask		= bic_mask_irq,
	.eoi		= bic_eoi_irq,
};
#endif


/* Note that the BIC (and other devices) are at phys addresses > 4GB */
#define BIC_PHYS 0x730000000LL

/* These are defined by the hardware. */
#define NR_BIC_GROUPS 15
#define NR_BIC_GINTS 32
#define NR_BIC_CPUS 4

/* 4-bit target value for target register */
#define BIC_TARGET_MASK (0xf)
#define BIC_TARGET_TYPE_NORMAL (1<<2)
#define BIC_TARGET_NORMAL(cpu) (BIC_TARGET_TYPE_NORMAL|(cpu))
#define BIC_DEFAULT_CPU 0
#define BIC_IPI_GROUP 0

/* Define the layout of each group's registers.
 * This layout should be 0x80 bytes long (including pad).
 */
struct bic_group_regs {
	uint32_t status;			/* 0x00  RW */
	uint32_t rd_clr_status;			/* 0x04  RO */
	uint32_t status_clr;			/* 0x08  WO */
	uint32_t status_set;			/* 0x0c  WO */
	uint32_t target[4];			/* 0x10  RW */
	uint32_t normal[NR_BIC_CPUS];		/* 0x20  RW */
	uint32_t critical[NR_BIC_CPUS];		/* 0x30  RW */
	uint32_t mcheck[NR_BIC_CPUS];		/* 0x40  RW */
	uint32_t _pad[12];			/* 0x50     */
};

/* Define the layout of the interrupt controller mem mapped regs. */
struct bic_regs {
	struct bic_group_regs group[NR_BIC_GROUPS];		/* 0x000 */
	uint32_t hier_normal[NR_BIC_CPUS];			/* 0x780 */
	uint32_t hier_critical[NR_BIC_CPUS];			/* 0x790 */
	uint32_t hier_mcheck[NR_BIC_CPUS];			/* 0x7a0 */
};

/*  This table is indexed by 'real' IRQ, i.e. BIC values. Linux 'virtual' IRQs are +32 */
static volatile unsigned char intended_cpu_for_irq[NR_BIC_GROUPS*NR_BIC_GINTS] =
  {
/*  0 */
      BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),
      BIC_TARGET_NORMAL(1),BIC_TARGET_NORMAL(1),BIC_TARGET_NORMAL(1),BIC_TARGET_NORMAL(1),
      BIC_TARGET_NORMAL(2),BIC_TARGET_NORMAL(2),BIC_TARGET_NORMAL(2),BIC_TARGET_NORMAL(2),
      BIC_TARGET_NORMAL(3),BIC_TARGET_NORMAL(3),BIC_TARGET_NORMAL(3),BIC_TARGET_NORMAL(3),

      BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),
      BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),BIC_TARGET_NORMAL(0),
/*  32 */
